Repository: dobermanch/dev-tools
Catalog: src/Dev.Tools.Localization/Resources/ToolResources.*.resx
Languages: uk_ua

# Tools.UlidGenerator.Name
source: ULID Generator
uk_ua: Генератор ULID

# Tools.UlidGenerator.Description
source: Generates Universally Unique Lexicographically Sortable Identifiers (ULIDs) which are sortable, URL-safe, and timestamp-based
uk_ua: Генерує універсальні унікальні лексикографічно сортовані ідентифікатори (ULID), які є сортованими, URL-безпечними та базуються на часовій мітці

# Tools.UlidGenerator.Args.Type.Name
source: ULID Type
uk_ua: Тип ULID

# Tools.UlidGenerator.Args.Type.Description
source: Type of ULID to generate
uk_ua: Тип ULID для генерації

# Tools.UlidGenerator.Args.Count.Name
source: Count
uk_ua: Кількість

# Tools.UlidGenerator.Args.Count.Description
source: Number of ULIDs to generate
uk_ua: Кількість ULID для генерації

# Tools.UlidGenerator.Result.Data.Name
source: ULIDs
uk_ua: ULID

# Tools.UlidGenerator.Result.Data.Description
source: The generated ULIDs
uk_ua: Згенеровані ULID

# Tools.UlidGenerator.Enums.UlidType.Random
source: Random ULID
uk_ua: Випадковий ULID

# Tools.UlidGenerator.Enums.UlidType.Min
source: Minimum value
uk_ua: Мінімальне значення

# Tools.UlidGenerator.Enums.UlidType.Max
source: Maximum value
uk_ua: Максимальне значення

# Tools.UrlParser.Name
source: URL Parser
uk_ua: Парсер URL

# Tools.UrlParser.Description
source: Parses and extracts all components from a URL including scheme, hostname, port, path, query parameters, and credentials
uk_ua: Парсить та витягає всі компоненти з URL, включаючи схему, ім'я хоста, порт, шлях, параметри запиту та облікові дані

# Tools.UrlParser.Args.Url.Description
source: URL to parse and analyze
uk_ua: URL для парсингу та аналізу

# Tools.UrlParser.Result.Schema.Name
source: Scheme
uk_ua: Схема

# Tools.UrlParser.Result.Schema.Description
source: URL scheme (http, https, ftp, etc.)
uk_ua: Схема URL (http, https, ftp тощо)

# Tools.UrlParser.Result.Username.Name
source: Username
uk_ua: Ім'я користувача

# Tools.UrlParser.Result.Username.Description
source: Username from the URL (if present)
uk_ua: Ім'я користувача з URL (якщо присутнє)

# Tools.UrlParser.Result.Password.Name
source: Password
uk_ua: Пароль

# Tools.UrlParser.Result.Password.Description
source: Password from the URL (if present)
uk_ua: Пароль з URL (якщо присутній)

# Tools.UrlParser.Result.Hostname.Name
source: Hostname
uk_ua: Ім'я хоста

# Tools.UrlParser.Result.Hostname.Description
source: Domain name or IP address
uk_ua: Доменне ім'я або IP-адреса

# Tools.UrlParser.Result.Port.Name
source: Port
uk_ua: Порт

# Tools.UrlParser.Result.Port.Description
source: Port number (if specified)
uk_ua: Номер порту (якщо вказано)

# Tools.UrlParser.Result.Path.Name
source: Path
uk_ua: Шлях

# Tools.UrlParser.Result.Path.Description
source: URL path component
uk_ua: Компонент шляху URL

# Tools.UrlParser.Result.Query.Name
source: Query String
uk_ua: Рядок запиту

# Tools.UrlParser.Result.Query.Description
source: Full query string
uk_ua: Повний рядок запиту

# Tools.UrlParser.Result.Parameters.Name
source: Parameters
uk_ua: Параметри

# Tools.UrlParser.Result.Parameters.Description
source: Parsed query string parameters as key-value pairs
uk_ua: Розпарсені параметри рядка запиту як пари ключ-значення

# Tools.UuidGenerator.Name
source: UUID Generator
uk_ua: Генератор UUID

# Tools.UuidGenerator.Description
source: Generates Universally Unique Identifiers (UUIDs/GUIDs) in various versions including V3 (MD5), V4 (random), V5 (SHA-1), and V7 (timestamp-based)
uk_ua: Генерує універсальні унікальні ідентифікатори (UUID/GUID) різних версій, включаючи V3 (MD5), V4 (випадковий), V5 (SHA-1) та V7 (базований на часовій мітці)

# Tools.UuidGenerator.Args.Type.Name
source: UUID Version
uk_ua: Версія UUID

# Tools.UuidGenerator.Args.Type.Description
source: UUID version to generate
uk_ua: Версія UUID для генерації

# Tools.UuidGenerator.Args.Count.Name
source: Count
uk_ua: Кількість

# Tools.UuidGenerator.Args.Count.Description
source: Number of UUIDs to generate
uk_ua: Кількість UUID для генерації

# Tools.UuidGenerator.Args.Namespace.Name
source: Namespace
uk_ua: Простір імен

# Tools.UuidGenerator.Args.Namespace.Description
source: Namespace UUID (required for V3 and V5)
uk_ua: UUID простору імен (обов'язковий для V3 та V5)

# Tools.UuidGenerator.Args.Name.Name
source: Name
uk_ua: Назва

# Tools.UuidGenerator.Args.Name.Description
source: Name to hash with namespace (for V3 and V5)
uk_ua: Назва для хешування з простором імен (для V3 та V5)

# Tools.UuidGenerator.Args.Time.Name
source: Timestamp
uk_ua: Часова мітка

# Tools.UuidGenerator.Args.Time.Description
source: Custom timestamp (for V7, defaults to current time)
uk_ua: Власна часова мітка (для V7, за замовчуванням поточний час)

# Tools.UuidGenerator.Result.Data.Name
source: UUIDs
uk_ua: UUID

# Tools.UuidGenerator.Result.Data.Description
source: The generated UUIDs
uk_ua: Згенеровані UUID

# Tools.UuidGenerator.Enums.UuidType.Nil
source: Nil UUID (all zeros)
uk_ua: Nil UUID (всі нулі)

# Tools.UuidGenerator.Enums.UuidType.V3
source: Version 3 (MD5 hash)
uk_ua: Версія 3 (MD5 хеш)

# Tools.UuidGenerator.Enums.UuidType.V4
source: Version 4 (random)
uk_ua: Версія 4 (випадковий)

# Tools.UuidGenerator.Enums.UuidType.V5
source: Version 5 (SHA-1 hash)
uk_ua: Версія 5 (SHA-1 хеш)

# Tools.UuidGenerator.Enums.UuidType.V7
source: Version 7 (timestamp-based)
uk_ua: Версія 7 (базований на часовій мітці)

# Tools.UuidGenerator.Enums.UuidType.Max
source: Max UUID (all ones)
uk_ua: Max UUID (всі одиниці)

# Tools.LoremIpsumGenerator.Name
source: Lorem Ipsum Generator
uk_ua: Генератор Lorem Ipsum

# Tools.LoremIpsumGenerator.Description
source: Generates Lorem Ipsum placeholder text with configurable number of paragraphs, sentences, and words
uk_ua: Генерує текст-заповнювач Lorem Ipsum з налаштовуваною кількістю абзаців, речень та слів

# Tools.LoremIpsumGenerator.Args.Paragraphs.Name
source: Paragraphs
uk_ua: Абзаци

# Tools.LoremIpsumGenerator.Args.Paragraphs.Description
source: Number of paragraphs to generate
uk_ua: Кількість абзаців для генерації

# Tools.LoremIpsumGenerator.Args.SentencesPerParagraph.Name
source: Sentences per Paragraph
uk_ua: Речень в абзаці

# Tools.LoremIpsumGenerator.Args.SentencesPerParagraph.Description
source: Number of sentences in each paragraph
uk_ua: Кількість речень у кожному абзаці

# Tools.LoremIpsumGenerator.Args.WordsPerSentence.Name
source: Words per Sentence
uk_ua: Слів у реченні

# Tools.LoremIpsumGenerator.Args.WordsPerSentence.Description
source: Number of words in each sentence
uk_ua: Кількість слів у кожному реченні

# Tools.LoremIpsumGenerator.Args.StartWithLoremIpsum.Name
source: Start with Lorem Ipsum
uk_ua: Починати з Lorem Ipsum

# Tools.LoremIpsumGenerator.Args.StartWithLoremIpsum.Description
source: Begin the first sentence with the classic "Lorem ipsum dolor sit amet..." opening
uk_ua: Починати перше речення з класичного "Lorem ipsum dolor sit amet..."

# Tools.LoremIpsumGenerator.Result.Text.Name
source: Generated Text
uk_ua: Згенерований текст

# Tools.LoremIpsumGenerator.Result.Text.Description
source: The generated Lorem Ipsum placeholder text
uk_ua: Згенерований текст-заповнювач Lorem Ipsum

# Tools.JwtParser.Name
source: JWT Parser
uk_ua: Парсер JWT

# Tools.JwtParser.Description
source: Parses and decodes JWT tokens, extracting the header, payload claims, signature, and all standard registered fields
uk_ua: Парсить та декодує JWT токени, витягуючи заголовок, клейми пейлоду, підпис та всі стандартні зареєстровані поля

# Tools.JwtParser.Args.Token.Name
source: JWT Token
uk_ua: JWT Токен

# Tools.JwtParser.Args.Token.Description
source: JWT token to parse (three Base64url-encoded parts separated by dots)
uk_ua: JWT токен для парсингу (три частини, закодовані Base64url, розділені крапками)

# Tools.JwtParser.Result.HeaderJson.Name
source: Header
uk_ua: Заголовок

# Tools.JwtParser.Result.HeaderJson.Description
source: Decoded and formatted header JSON containing the algorithm and token type
uk_ua: Декодований та відформатований JSON заголовка з алгоритмом та типом токена

# Tools.JwtParser.Result.PayloadJson.Name
source: Payload
uk_ua: Пейлод

# Tools.JwtParser.Result.PayloadJson.Description
source: Decoded and formatted payload JSON containing all claims
uk_ua: Декодований та відформатований JSON пейлода з усіма клеймами

# Tools.JwtParser.Result.Signature.Name
source: Signature
uk_ua: Підпис

# Tools.JwtParser.Result.Signature.Description
source: Raw Base64url-encoded signature (third part of the token)
uk_ua: Необроблений підпис у кодуванні Base64url (третя частина токена)

# Tools.JwtParser.Result.Algorithm.Name
source: Algorithm
uk_ua: Алгоритм

# Tools.JwtParser.Result.Algorithm.Description
source: Signing algorithm from the header (alg claim)
uk_ua: Алгоритм підпису з заголовка (клейм alg)

# Tools.JwtParser.Result.TokenType.Name
source: Token Type
uk_ua: Тип токена

# Tools.JwtParser.Result.TokenType.Description
source: Token type from the header (typ claim)
uk_ua: Тип токена з заголовка (клейм typ)

# Tools.JwtParser.Result.Issuer.Name
source: Issuer
uk_ua: Видавець

# Tools.JwtParser.Result.Issuer.Description
source: Issuer of the token (iss claim)
uk_ua: Видавець токена (клейм iss)

# Tools.JwtParser.Result.Subject.Name
source: Subject
uk_ua: Суб'єкт

# Tools.JwtParser.Result.Subject.Description
source: Subject of the token (sub claim)
uk_ua: Суб'єкт токена (клейм sub)

# Tools.JwtParser.Result.Audience.Name
source: Audience
uk_ua: Аудиторія

# Tools.JwtParser.Result.Audience.Description
source: Intended recipients of the token (aud claim)
uk_ua: Призначені одержувачі токена (клейм aud)

# Tools.JwtParser.Result.IssuedAt.Name
source: Issued At
uk_ua: Видано о

# Tools.JwtParser.Result.IssuedAt.Description
source: Time the token was issued (iat claim)
uk_ua: Час видачі токена (клейм iat)

# Tools.JwtParser.Result.NotBefore.Name
source: Not Before
uk_ua: Не раніше

# Tools.JwtParser.Result.NotBefore.Description
source: Time before which the token is not valid (nbf claim)
uk_ua: Час, до якого токен є недійсним (клейм nbf)

# Tools.JwtParser.Result.ExpiresAt.Name
source: Expires At
uk_ua: Закінчується о

# Tools.JwtParser.Result.ExpiresAt.Description
source: Expiration time of the token (exp claim)
uk_ua: Час закінчення дії токена (клейм exp)

# Tools.JwtParser.Result.JwtId.Name
source: JWT ID
uk_ua: ID JWT

# Tools.JwtParser.Result.JwtId.Description
source: Unique identifier for the token (jti claim)
uk_ua: Унікальний ідентифікатор токена (клейм jti)

# Tools.JwtParser.Result.Claims.Name
source: Claims
uk_ua: Клейми

# Tools.JwtParser.Result.Claims.Description
source: All payload claims as key-value pairs
uk_ua: Усі клейми пейлода у вигляді пар ключ-значення

# Tools.XmlFormatter.Name
source: XML Formatter
uk_ua: Форматувальник XML

# Tools.XmlFormatter.Description
source: Formats and beautifies XML with options for indentation, element sorting, case conversion, and removal of empty elements
uk_ua: Форматує та прикрашує XML з опціями для відступів, сортування елементів, конвертації регістру та видалення порожніх елементів

# Tools.XmlFormatter.Args.Xml.Description
source: XML text to format
uk_ua: XML-текст для форматування

# Tools.XmlFormatter.Args.IndentSize.Name
source: Indent Size
uk_ua: Розмір відступу

# Tools.XmlFormatter.Args.IndentSize.Description
source: Number of spaces for indentation
uk_ua: Кількість пробілів для відступу

# Tools.XmlFormatter.Args.SortKeys.Name
source: Sort Elements
uk_ua: Сортувати елементи

# Tools.XmlFormatter.Args.SortKeys.Description
source: Sort XML elements alphabetically
uk_ua: Сортувати XML-елементи за абеткою

# Tools.XmlFormatter.Args.KeyFormat.Name
source: Element Name Format
uk_ua: Формат імен елементів

# Tools.XmlFormatter.Args.KeyFormat.Description
source: Case format to apply to all element names
uk_ua: Формат регістру для застосування до всіх імен елементів

# Tools.XmlFormatter.Args.ExcludeEmpty.Name
source: Exclude Empty
uk_ua: Виключити порожні

# Tools.XmlFormatter.Args.ExcludeEmpty.Description
source: Remove empty elements from output
uk_ua: Видалити порожні елементи з виводу

# Tools.XmlFormatter.Args.Compact.Name
source: Compact
uk_ua: Компактний

# Tools.XmlFormatter.Args.Compact.Description
source: Minify XML by removing all whitespace
uk_ua: Мінімізувати XML, видаливши всі пробіли

# Tools.XmlFormatter.Result.Xml.Name
source: Formatted XML
uk_ua: Форматований XML

# Tools.XmlFormatter.Result.Xml.Description
source: The formatted XML output
uk_ua: Форматований вихідний XML

# Tools.XmlFormatter.Enums.SortDirection.None
source: No sorting
uk_ua: Без сортування

# Tools.XmlFormatter.Enums.SortDirection.Ascending
source: Ascending (A-Z)
uk_ua: За зростанням (А-Я)

# Tools.XmlFormatter.Enums.SortDirection.Descending
source: Descending (Z-A)
uk_ua: За спаданням (Я-А)

# Tools.XmlFormatter.Enums.TextCase.None
source: No changes
uk_ua: Без змін

# Tools.XmlFormatter.Enums.TextCase.LowerCase
source: lowercase
uk_ua: малі літери

# Tools.XmlFormatter.Enums.TextCase.UpperCase
source: UPPERCASE
uk_ua: ВЕЛИКІ ЛІТЕРИ
