Repository: dobermanch/dev-tools
Catalog: src/Dev.Tools.Localization/Resources/ToolResources.*.resx
Languages: uk_ua

# Enums.Category.Converter
source: Converter
uk_ua: Конвертер

# Enums.Category.Crypto
source: Cryptography
uk_ua: Криптографія

# Enums.Category.Network
source: Network
uk_ua: Мережа

# Enums.Category.Security
source: Security
uk_ua: Безпека

# Enums.Category.Text
source: Text
uk_ua: Текст

# Enums.Category.Web
source: Web
uk_ua: Веб

# Enums.ErrorCode.FailedToDecrypt
source: Failed to decrypt
uk_ua: Помилка дешифрування

# Enums.ErrorCode.InputNotValid
source: Input is not valid
uk_ua: Вхідні дані недійсні

# Enums.ErrorCode.NamespaceEmpty
source: Namespace cannot be empty
uk_ua: Простір імен не може бути порожнім

# Enums.ErrorCode.TextEmpty
source: Text cannot be empty
uk_ua: Текст не може бути порожнім

# Enums.ErrorCode.Unknown
source: Unknown error
uk_ua: Невідома помилка

# Enums.ErrorCode.WrongBase
source: Invalid number base
uk_ua: Недійсна система числення

# Enums.ErrorCode.WrongFormat
source: Invalid format
uk_ua: Недійсний формат

# Enums.Keyword.Case
source: Case
uk_ua: Регістр

# Enums.Keyword.Convert
source: Convert
uk_ua: Конвертувати

# Enums.Keyword.Decode
source: Decode
uk_ua: Декодувати

# Enums.Keyword.Encode
source: Encode
uk_ua: Кодувати

# Enums.Keyword.Format
source: Format
uk_ua: Формат

# Enums.Keyword.Generate
source: Generate
uk_ua: Генерувати

# Enums.Keyword.Hash
source: Hash
uk_ua: Хеш

# Enums.Keyword.Internet
source: Internet
uk_ua: Інтернет

# Enums.Keyword.Ip
source: IP Address
uk_ua: IP-адреса

# Enums.Keyword.Network
source: Network
uk_ua: Мережа

# Enums.Keyword.Password
source: Password
uk_ua: Пароль

# Enums.Keyword.String
source: String
uk_ua: Рядок

# Enums.Keyword.Text
source: Text
uk_ua: Текст

# Enums.Keyword.Token
source: Token
uk_ua: Токен

# Enums.Keyword.Web
source: Web
uk_ua: Веб

# Tools.Base64Decoder.Name
source: Base64 Decoder
uk_ua: Декодер Base64

# Tools.Base64Decoder.Description
source: Decodes Base64-encoded text back to its original string representation using UTF-8 encoding
uk_ua: Декодує текст з формату Base64 назад до оригінального рядка з використанням кодування UTF-8

# Tools.Base64Decoder.Args.Text.Name
source: Text
uk_ua: Текст

# Tools.Base64Decoder.Args.Text.Description
source: Base64-encoded text to decode
uk_ua: Текст у форматі Base64 для декодування

# Tools.Base64Decoder.Result.Data.Name
source: Decoded Text
uk_ua: Декодований текст

# Tools.Base64Decoder.Result.Data.Description
source: The decoded text in its original format
uk_ua: Декодований текст у оригінальному форматі

# Tools.Base64Encoder.Name
source: Base64 Encoder
uk_ua: Кодер Base64

# Tools.Base64Encoder.Description
source: Encodes text to Base64 format with optional URL-safe encoding and line breaks for compatibility with various systems
uk_ua: Кодує текст у формат Base64 з опціональним URL-безпечним кодуванням та переносами рядків для сумісності з різними системами

# Tools.Base64Encoder.Args.Text.Name
source: Text
uk_ua: Текст

# Tools.Base64Encoder.Args.Text.Description
source: Text to encode to Base64 format
uk_ua: Текст для кодування у формат Base64

# Tools.Base64Encoder.Args.InsertLineBreaks.Name
source: Insert Line Breaks
uk_ua: Вставити переноси рядків

# Tools.Base64Encoder.Args.InsertLineBreaks.Description
source: Insert line breaks every 76 characters for better readability
uk_ua: Вставляти переноси рядків кожні 76 символів для кращої читабельності

# Tools.Base64Encoder.Args.UrlSafe.Name
source: URL Safe
uk_ua: Безпечний URL

# Tools.Base64Encoder.Args.UrlSafe.Description
source: Use URL-safe encoding (replaces + with -, / with _, and removes padding)
uk_ua: Використовувати URL-безпечне кодування (заміна + на -, / на _, та видалення заповнення)

# Tools.Base64Encoder.Result.Text.Name
source: Encoded Text
uk_ua: Закодований текст

# Tools.Base64Encoder.Result.Text.Description
source: The Base64-encoded text
uk_ua: Текст, закодований у Base64

# Tools.CaseConverter.Name
source: Case Converter
uk_ua: Конвертер регістру

# Tools.CaseConverter.Description
source: Converts text between various casing formats including camelCase, PascalCase, snake_case, kebab-case, and many others
uk_ua: Конвертує текст між різними форматами регістру, включаючи camelCase, PascalCase, snake_case, kebab-case та багато інших

# Tools.CaseConverter.Args.Text.Name
source: Text
uk_ua: Текст

# Tools.CaseConverter.Args.Text.Description
source: Text to convert to a different case format
uk_ua: Текст для конвертації у інший формат регістру

# Tools.CaseConverter.Args.Type.Name
source: Case Type
uk_ua: Тип регістру

# Tools.CaseConverter.Args.Type.Description
source: Target case format for the conversion
uk_ua: Цільовий формат регістру для конвертації

# Tools.CaseConverter.Result.Text.Name
source: Converted Text
uk_ua: Конвертований текст

# Tools.CaseConverter.Result.Text.Description
source: The text in the requested case format
uk_ua: Текст у запитаному форматі регістру

# Tools.CaseConverter.Enums.CaseType.None
source: None
uk_ua: Без змін

# Tools.CaseConverter.Enums.CaseType.LowerCase
source: lowercase
uk_ua: малі літери

# Tools.CaseConverter.Enums.CaseType.UpperCase
source: UPPERCASE
uk_ua: ВЕЛИКІ ЛІТЕРИ

# Tools.CaseConverter.Enums.CaseType.CapitalCase
source: Capital Case
uk_ua: Регістр З Великої Літери

# Tools.CaseConverter.Enums.CaseType.NoCase
source: no case
uk_ua: без регістру

# Tools.CaseConverter.Enums.CaseType.PathForwardCase
source: path/forward/case
uk_ua: шлях/прямий/регістр

# Tools.CaseConverter.Enums.CaseType.PathBackwardCase
source: path\backward\case
uk_ua: шлях\зворотний\регістр

# Tools.CaseConverter.Enums.CaseType.SentenceCase
source: Sentence case
uk_ua: Регістр речення

# Tools.CaseConverter.Enums.CaseType.MockingCase
source: mOcKiNg cAsE
uk_ua: нАсМіШлИвИй РеГіСтР

# Tools.CharacterViewer.Name
source: Character Viewer
uk_ua: Переглядач символів

# Tools.CharacterViewer.Description
source: Analyzes and visualizes non-standard, control, and special characters in text, revealing hidden Unicode characters with detailed information
uk_ua: Аналізує та візуалізує нестандартні, керуючі та спеціальні символи в тексті, виявляючи приховані символи Unicode з детальною інформацією

# Tools.CharacterViewer.Args.Text.Name
source: Text
uk_ua: Текст

# Tools.CharacterViewer.Args.Text.Description
source: Text to analyze for special characters
uk_ua: Текст для аналізу спеціальних символів

# Tools.CharacterViewer.Args.ViewType.Name
source: View Type
uk_ua: Тип перегляду

# Tools.CharacterViewer.Args.ViewType.Description
source: How to display special and control characters
uk_ua: Як відображати спеціальні та керуючі символи

# Tools.CharacterViewer.Args.IncludeCharInfo.Name
source: Include Character Info
uk_ua: Включити інформацію про символи

# Tools.CharacterViewer.Args.IncludeCharInfo.Description
source: Include detailed information about each character (Unicode category, hex codes, etc.)
uk_ua: Включити детальну інформацію про кожен символ (категорія Unicode, hex-коди тощо)

# Tools.CharacterViewer.Args.TreatAsStandardHexCodes.Name
source: Treat As Standard
uk_ua: Вважати стандартними

# Tools.CharacterViewer.Args.TreatAsStandardHexCodes.Description
source: List of Unicode characters (e.g., U+00A0) to treat as standard characters
uk_ua: Список символів Unicode (напр., U+00A0) для обробки як стандартних символів

# Tools.CharacterViewer.Result.Text.Name
source: Processed Text
uk_ua: Оброблений текст

# Tools.CharacterViewer.Result.Text.Description
source: The text after processing based on the selected view type
uk_ua: Текст після обробки на основі обраного типу перегляду

# Tools.CharacterViewer.Result.CharInfos.Name
source: Character Details
uk_ua: Деталі символів

# Tools.CharacterViewer.Result.CharInfos.Description
source: Detailed information about each character in the text
uk_ua: Детальна інформація про кожен символ у тексті

# Tools.CharacterViewer.Enums.ViewType.None
source: No changes
uk_ua: Без змін

# Tools.CharacterViewer.Enums.ViewType.RevealAll
source: Reveal all special characters
uk_ua: Показати всі спеціальні символи

# Tools.CharacterViewer.Enums.ViewType.RevealNonStandard
source: Reveal non-standard characters
uk_ua: Показати нестандартні символи

# Tools.CharacterViewer.Enums.ViewType.RemoveAll
source: Remove all special characters
uk_ua: Видалити всі спеціальні символи

# Tools.CharacterViewer.Enums.ViewType.RemoveNonStandard
source: Remove non-standard characters
uk_ua: Видалити нестандартні символи

# Tools.DateTimeConverter.Name
source: Date/Time Converter
uk_ua: Конвертер дати/часу

# Tools.DateTimeConverter.Description
source: Converts dates and times between various formats including Unix timestamps, ISO 8601, RFC standards, Excel dates, and MongoDB ObjectIds
uk_ua: Конвертує дати та час між різними форматами, включаючи Unix timestamps, ISO 8601, RFC стандарти, дати Excel та MongoDB ObjectIds

# Tools.DateTimeConverter.Args.Date.Name
source: Date/Time
uk_ua: Дата/Час

# Tools.DateTimeConverter.Args.Date.Description
source: Date/time value to convert (leave empty for current date/time)
uk_ua: Значення дати/часу для конвертації (залиште порожнім для поточної дати/часу)

# Tools.DateTimeConverter.Args.From.Name
source: From Format
uk_ua: Вихідний формат

# Tools.DateTimeConverter.Args.From.Description
source: Source format of the input date/time
uk_ua: Вихідний формат вхідної дати/часу

# Tools.DateTimeConverter.Args.To.Name
source: To Format
uk_ua: Цільовий формат

# Tools.DateTimeConverter.Args.To.Description
source: Target format for the output date/time
uk_ua: Цільовий формат для вихідної дати/часу

# Tools.DateTimeConverter.Result.Time.Name
source: Converted Time
uk_ua: Конвертований час

# Tools.DateTimeConverter.Result.Time.Description
source: The date/time in the requested format
uk_ua: Дата/час у запитаному форматі

# Tools.DateTimeConverter.Enums.DateFormatType.Unix
source: Unix timestamp (seconds)
uk_ua: Unix timestamp (секунди)

# Tools.DateTimeConverter.Enums.DateFormatType.Timestamp
source: Timestamp (milliseconds)
uk_ua: Timestamp (мілісекунди)

# Tools.DateTimeConverter.Enums.DateFormatType.ExcelDateTime
source: Excel date/time
uk_ua: Дата/час Excel

# Tools.DateTimeConverter.Enums.DateFormatType.JsDateTime
source: JavaScript date/time
uk_ua: Дата/час JavaScript

# Tools.HashText.Name
source: Hash Generator
uk_ua: Генератор хешів

# Tools.HashText.Description
source: Generates cryptographic hash values from text using various algorithms including MD5, SHA-1, SHA-256, SHA-384, and SHA-512
uk_ua: Генерує криптографічні хеш-значення з тексту, використовуючи різні алгоритми, включаючи MD5, SHA-1, SHA-256, SHA-384 та SHA-512

# Tools.HashText.Args.Text.Name
source: Text
uk_ua: Текст

# Tools.HashText.Args.Text.Description
source: Text to generate a hash from
uk_ua: Текст для генерації хешу

# Tools.HashText.Args.Algorithm.Name
source: Algorithm
uk_ua: Алгоритм

# Tools.HashText.Args.Algorithm.Description
source: Hashing algorithm to use
uk_ua: Алгоритм хешування для використання

# Tools.HashText.Result.Data.Name
source: Hash Value
uk_ua: Хеш-значення

# Tools.HashText.Result.Data.Description
source: The generated hash in hexadecimal format
uk_ua: Згенерований хеш у шістнадцятковому форматі

# Tools.IntegerBaseConverter.Name
source: Integer Base Converter
uk_ua: Конвертер систем числення

# Tools.IntegerBaseConverter.Description
source: Converts integers between different number bases including binary, octal, decimal, hexadecimal, Base64, and custom bases (2-64)
uk_ua: Конвертує цілі числа між різними системами числення, включаючи двійкову, вісімкову, десяткову, шістнадцяткову, Base64 та інші системи (2-64)

# Tools.IntegerBaseConverter.Args.InputValue.Name
source: Input Value
uk_ua: Вхідне значення

# Tools.IntegerBaseConverter.Args.InputValue.Description
source: Number to convert
uk_ua: Число для конвертації

# Tools.IntegerBaseConverter.Args.InputBase.Name
source: Input Base
uk_ua: Вхідна система

# Tools.IntegerBaseConverter.Args.InputBase.Description
source: Number base of the input value
uk_ua: Система числення вхідного значення

# Tools.IntegerBaseConverter.Args.TargetBase.Name
source: Target Base
uk_ua: Цільова система

# Tools.IntegerBaseConverter.Args.TargetBase.Description
source: Number base for the output value
uk_ua: Система числення для вихідного значення

# Tools.IntegerBaseConverter.Result.Data.Name
source: Converted Value
uk_ua: Конвертоване значення

# Tools.IntegerBaseConverter.Result.Data.Description
source: The number in the target base
uk_ua: Число у цільовій системі числення

# Tools.IntegerBaseConverter.Result.Base.Name
source: Base
uk_ua: Система

# Tools.IntegerBaseConverter.Result.Base.Description
source: The base of the converted value
uk_ua: Система числення конвертованого значення

# Tools.IntegerBaseConverter.Enums.BaseType.Binary
source: Binary (base 2)
uk_ua: Двійкова (основа 2)

# Tools.IntegerBaseConverter.Enums.BaseType.Octal
source: Octal (base 8)
uk_ua: Вісімкова (основа 8)

# Tools.IntegerBaseConverter.Enums.BaseType.Decimal
source: Decimal (base 10)
uk_ua: Десяткова (основа 10)

# Tools.IntegerBaseConverter.Enums.BaseType.Hexadecimal
source: Hexadecimal (base 16)
uk_ua: Шістнадцяткова (основа 16)

# Tools.IntegerBaseConverter.Enums.BaseType.Base64
source: Base64 (base 64)
uk_ua: Base64 (основа 64)

# Tools.IntegerToRomanConverter.Name
source: Roman Numeral Converter
uk_ua: Конвертер римських чисел

# Tools.IntegerToRomanConverter.Description
source: Converts between decimal integers (1-3999) and Roman numerals (I, V, X, L, C, D, M)
uk_ua: Конвертує між десятковими цілими числами (1-3999) та римськими цифрами (I, V, X, L, C, D, M)

# Tools.IntegerToRomanConverter.Args.Number.Name
source: Number
uk_ua: Число

# Tools.IntegerToRomanConverter.Args.Number.Description
source: Decimal number or Roman numeral to convert
uk_ua: Десяткове число або римська цифра для конвертації

# Tools.IntegerToRomanConverter.Args.Transcoding.Name
source: Direction
uk_ua: Напрямок

# Tools.IntegerToRomanConverter.Args.Transcoding.Description
source: Convert to Roman numerals or from Roman numerals
uk_ua: Конвертувати у римські цифри або з римських цифр

# Tools.IntegerToRomanConverter.Result.Number.Name
source: Converted Value
uk_ua: Конвертоване значення

# Tools.IntegerToRomanConverter.Result.Number.Description
source: The converted Roman numeral or decimal number
uk_ua: Конвертована римська цифра або десяткове число

# Tools.IntegerToRomanConverter.Enums.TranscodingType.Encode
source: To Roman numerals
uk_ua: У римські цифри

# Tools.IntegerToRomanConverter.Enums.TranscodingType.Decode
source: From Roman numerals
uk_ua: З римських цифр

# Tools.IpDetails.Name
source: IP Address Detector
uk_ua: Детектор IP-адрес

# Tools.IpDetails.Description
source: Retrieves your current public IPv4 and IPv6 addresses by querying external services
uk_ua: Отримує ваші поточні публічні IPv4 та IPv6 адреси, запитуючи зовнішні сервіси

# Tools.IpDetails.Result.IpV4.Name
source: IPv4 Address
uk_ua: IPv4 адреса

# Tools.IpDetails.Result.IpV4.Description
source: Your public IPv4 address
uk_ua: Ваша публічна IPv4 адреса

# Tools.IpDetails.Result.IpV6.Name
source: IPv6 Address
uk_ua: IPv6 адреса

# Tools.IpDetails.Result.IpV6.Description
source: Your public IPv6 address
uk_ua: Ваша публічна IPv6 адреса

# Tools.JsonFormatter.Name
source: JSON Formatter
uk_ua: Форматувальник JSON

# Tools.JsonFormatter.Description
source: Formats and beautifies JSON with options for indentation, key sorting, case conversion, and removal of empty values
uk_ua: Форматує та прикрашує JSON з опціями для відступів, сортування ключів, конвертації регістру та видалення порожніх значень

# Tools.JsonFormatter.Args.Json.Description
source: JSON text to format
uk_ua: JSON-текст для форматування

# Tools.JsonFormatter.Args.IndentSize.Name
source: Indent Size
uk_ua: Розмір відступу

# Tools.JsonFormatter.Args.IndentSize.Description
source: Number of spaces for indentation
uk_ua: Кількість пробілів для відступу

# Tools.JsonFormatter.Args.SortKeys.Name
source: Sort Keys
uk_ua: Сортувати ключі

# Tools.JsonFormatter.Args.SortKeys.Description
source: Sort object keys alphabetically
uk_ua: Сортувати ключі об'єктів за абеткою

# Tools.JsonFormatter.Args.KeyFormat.Name
source: Key Format
uk_ua: Формат ключів

# Tools.JsonFormatter.Args.KeyFormat.Description
source: Case format to apply to all keys
uk_ua: Формат регістру для застосування до всіх ключів

# Tools.JsonFormatter.Args.ExcludeEmpty.Name
source: Exclude Empty
uk_ua: Виключити порожні

# Tools.JsonFormatter.Args.ExcludeEmpty.Description
source: Remove null and empty values from output
uk_ua: Видалити null та порожні значення з виводу

# Tools.JsonFormatter.Args.Compact.Name
source: Compact
uk_ua: Компактний

# Tools.JsonFormatter.Args.Compact.Description
source: Minify JSON by removing all whitespace
uk_ua: Мінімізувати JSON, видаливши всі пробіли

# Tools.JsonFormatter.Result.Json.Name
source: Formatted JSON
uk_ua: Форматований JSON

# Tools.JsonFormatter.Result.Json.Description
source: The formatted JSON output
uk_ua: Форматований вихідний JSON

# Tools.JsonFormatter.Enums.SortDirection.None
source: No sorting
uk_ua: Без сортування

# Tools.JsonFormatter.Enums.SortDirection.Ascending
source: Ascending (A-Z)
uk_ua: За зростанням (А-Я)

# Tools.JsonFormatter.Enums.SortDirection.Descending
source: Descending (Z-A)
uk_ua: За спаданням (Я-А)

# Tools.JsonFormatter.Enums.TextCase.None
source: No changes
uk_ua: Без змін

# Tools.JsonFormatter.Enums.TextCase.LowerCase
source: lowercase
uk_ua: малі літери

# Tools.JsonFormatter.Enums.TextCase.UpperCase
source: UPPERCASE
uk_ua: ВЕЛИКІ ЛІТЕРИ

# Tools.PassphraseGenerator.Name
source: Passphrase Generator
uk_ua: Генератор парольних фраз

# Tools.PassphraseGenerator.Description
source: Generates memorable and secure passphrases by combining random words with optional separators, capitalization, and salt
uk_ua: Генерує запам'ятовувані та безпечні парольні фрази, об'єднуючи випадкові слова з опціональними роздільниками, великими літерами та сіллю

# Tools.PassphraseGenerator.Args.PhraseCount.Name
source: Phrase Count
uk_ua: Кількість фраз

# Tools.PassphraseGenerator.Args.PhraseCount.Description
source: Number of passphrases to generate
uk_ua: Кількість парольних фраз для генерації

# Tools.PassphraseGenerator.Args.WordCount.Name
source: Word Count
uk_ua: Кількість слів

# Tools.PassphraseGenerator.Args.WordCount.Description
source: Number of words per passphrase
uk_ua: Кількість слів у кожній парольній фразі

# Tools.PassphraseGenerator.Args.Separator.Name
source: Separator
uk_ua: Роздільник

# Tools.PassphraseGenerator.Args.Separator.Description
source: Character to separate words (e.g., -, _, space)
uk_ua: Символ для розділення слів (напр., -, _, пробіл)

# Tools.PassphraseGenerator.Args.Capitalize.Name
source: Capitalize
uk_ua: Велика перша літера

# Tools.PassphraseGenerator.Args.Capitalize.Description
source: Capitalize the first letter of the passphrase
uk_ua: Писати першу літеру парольної фрази з великої літери

# Tools.PassphraseGenerator.Args.Salt.Name
source: Salt
uk_ua: Сіль

# Tools.PassphraseGenerator.Args.Salt.Description
source: Custom text to append at the end of each passphrase
uk_ua: Користувацький текст для додавання в кінці кожної парольної фрази

# Tools.PassphraseGenerator.Result.Phrases.Name
source: Passphrases
uk_ua: Парольні фрази

# Tools.PassphraseGenerator.Result.Phrases.Description
source: The generated passphrases
uk_ua: Згенеровані парольні фрази

# Tools.SafeUrlTranscoder.Name
source: URL Encoder/Decoder
uk_ua: Кодер/Декодер URL

# Tools.SafeUrlTranscoder.Description
source: Encodes or decodes URLs by converting special characters to percent-encoded format for safe transmission
uk_ua: Кодує або декодує URL, конвертуючи спеціальні символи у відсотково-кодований формат для безпечної передачі

# Tools.SafeUrlTranscoder.Args.Url.Description
source: URL or text to encode/decode
uk_ua: URL або текст для кодування/декодування

# Tools.SafeUrlTranscoder.Args.Transcoding.Name
source: Operation
uk_ua: Операція

# Tools.SafeUrlTranscoder.Args.Transcoding.Description
source: Encode or decode the URL
uk_ua: Кодувати або декодувати URL

# Tools.SafeUrlTranscoder.Result.Url.Name
source: Result
uk_ua: Результат

# Tools.SafeUrlTranscoder.Result.Url.Description
source: The encoded or decoded URL
uk_ua: Закодований або декодований URL

# Tools.SafeUrlTranscoder.Enums.TranscodingType.Encode
source: Encode
uk_ua: Кодувати

# Tools.SafeUrlTranscoder.Enums.TranscodingType.Decode
source: Decode
uk_ua: Декодувати

# Tools.StringToNatoAlphabet.Name
source: NATO Phonetic Alphabet
uk_ua: Фонетичний алфавіт НАТО

# Tools.StringToNatoAlphabet.Description
source: Converts text to NATO phonetic alphabet words (Alfa, Bravo, Charlie, etc.) for clear voice communication
uk_ua: Конвертує текст у слова фонетичного алфавіту НАТО (Alfa, Bravo, Charlie тощо) для чіткої голосової комунікації

# Tools.StringToNatoAlphabet.Args.Text.Name
source: Text
uk_ua: Текст

# Tools.StringToNatoAlphabet.Args.Text.Description
source: Text to convert to NATO phonetic alphabet
uk_ua: Текст для конвертації у фонетичний алфавіт НАТО

# Tools.StringToNatoAlphabet.Result.Words.Name
source: NATO Words
uk_ua: Слова НАТО

# Tools.StringToNatoAlphabet.Result.Words.Description
source: The NATO phonetic alphabet representation
uk_ua: Представлення у фонетичному алфавіті НАТО

# Tools.TokenGenerator.Name
source: Token Generator
uk_ua: Генератор токенів

# Tools.TokenGenerator.Description
source: Generates random secure tokens with customizable length, character sets (uppercase, lowercase, numbers, symbols), and custom alphabets
uk_ua: Генерує випадкові безпечні токени з налаштовуваною довжиною, наборами символів (великі літери, малі літери, цифри, символи) та власними алфавітами

# Tools.TokenGenerator.Args.TokenLength.Name
source: Token Length
uk_ua: Довжина токена

# Tools.TokenGenerator.Args.TokenLength.Description
source: Length of each generated token
uk_ua: Довжина кожного згенерованого токена

# Tools.TokenGenerator.Args.TokenCount.Name
source: Token Count
uk_ua: Кількість токенів

# Tools.TokenGenerator.Args.TokenCount.Description
source: Number of tokens to generate
uk_ua: Кількість токенів для генерації

# Tools.TokenGenerator.Args.Uppercase.Name
source: Uppercase Letters
uk_ua: Великі літери

# Tools.TokenGenerator.Args.Uppercase.Description
source: Include uppercase letters (A-Z)
uk_ua: Включити великі літери (A-Z)

# Tools.TokenGenerator.Args.Lowercase.Name
source: Lowercase Letters
uk_ua: Малі літери

# Tools.TokenGenerator.Args.Lowercase.Description
source: Include lowercase letters (a-z)
uk_ua: Включити малі літери (a-z)

# Tools.TokenGenerator.Args.Numbers.Name
source: Numbers
uk_ua: Цифри

# Tools.TokenGenerator.Args.Numbers.Description
source: Include digits (0-9)
uk_ua: Включити цифри (0-9)

# Tools.TokenGenerator.Args.Symbols.Name
source: Symbols
uk_ua: Символи

# Tools.TokenGenerator.Args.Symbols.Description
source: Include special characters (!@#$%^&*...)
uk_ua: Включити спеціальні символи (!@#$%^&*...)

# Tools.TokenGenerator.Args.ExcludeSymbols.Name
source: Exclude Symbols
uk_ua: Виключити символи

# Tools.TokenGenerator.Args.ExcludeSymbols.Description
source: Specific characters to exclude from generation
uk_ua: Конкретні символи для виключення з генерації

# Tools.TokenGenerator.Args.Alphabet.Name
source: Custom Alphabet
uk_ua: Власний алфавіт

# Tools.TokenGenerator.Args.Alphabet.Description
source: Custom character set to use (overrides other options if provided)
uk_ua: Власний набір символів для використання (замінює інші опції, якщо вказано)

# Tools.TokenGenerator.Result.Tokens.Name
source: Generated Tokens
uk_ua: Згенеровані токени

# Tools.TokenGenerator.Result.Tokens.Description
source: The generated random tokens
uk_ua: Згенеровані випадкові токени
